go-go-golems/esp32-s3-m5/0113-papers3-mquickjs-spike/sdkconfig.defaults
# PaperS3 / ESP32-S3 MicroQuickJS feasibility spike (Phase 11, ESP-50).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PaperS3 has octal PSRAM; large JS arenas allocate there.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# The suite runs on the main task; MQuickJS's VM avoids CPU stack but the
# parser and our probe harness still want headroom.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_FREERTOS_HZ=1000

# Output is exclusively on native USB Serial/JTAG (same as 0112).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_UART is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Stable machine-readable logs.
CONFIG_LOG_COLORS=n
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
